public class Task00 {
    private static final int MIN_ARRAY_LEN = 3;

    public static void main(String[] args) {
        int[] array = {1, 2, 3};
        int value = 2;
        System.out.println(searchValue(null, value));
    }

    public static boolean getArrayLen(int[] arr) {
        if (arr.length >= MIN_ARRAY_LEN) {
            return true;
        }
        return false;
    }

    public static int searchValue(int[] args, int val) {
        if (args == null) return -3;
        if (!getArrayLen(args)) {
            return -1;
        }
        for (int i = 0; i < args.length; i++) {
            if (args[i] == val) {
                return i;
            }
        }
        return -2;
    }
}

//    Реализуйте метод, принимающий в качестве аргумента целочисленный массив и некоторое значение.
//    Метод ищет в массиве заданное значение и возвращает его индекс.
//    При этом, например:
////        если длина массива меньше некоторого заданного минимума, метод возвращает -1, в качестве кода ошибки.
////        если искомый элемент не найден, метод вернет -2 в качестве кода ошибки.
////        если вместо массива пришел null, метод вернет -3
////        придумайте свои варианты исключительных ситуаций и верните соответствующие коды ошибок.
// Напишите метод, в котором реализуйте взаимодействие с пользователем.
// То есть, этот метод запросит искомое число у пользователя, вызовет первый, обработает возвращенное значение и покажет читаемый результат пользователю.
// Например, если вернулся -2, пользователю выведется сообщение: “Искомый элемент не найден”.
